app/controllers/opportunities_controller.rb

  def index
    @opportunities = Opportunity.all
---
SELECT "opportunities".* FROM "opportunities"

  def destroy
    @opportunity.destroy
---
DELETE FROM "opportunities" WHERE "opportunities"."id" = $1  [["id", 402288]]

    def set_opportunity
      @opportunity = Opportunity.find(params[:id])
---
SELECT "opportunities".* FROM "opportunities" WHERE "opportunities"."id" = $1 LIMIT 1  [["id", "419491"]]